# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Specify a directory to install
cask_args appdir: '/Applications'

# Shell
brew "bash"
brew "bash-completion"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
cask "iterm2"

# File and Directory
brew "tree"
brew "wget"
brew "nano"
brew "grep"
brew "coreutils"

# Version Manangement
brew "pyenv"
brew "jenv"

# Git
brew "git"
brew "git-extras"

# IDE
cask "intellij-idea"
cask "visual-studio-code"

# WebDev
brew "node"

#SQL Stuff
cask "postgres-unofficial"
